pipeSteadyFixdFlux_v2406/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    pipeEntry
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 1000; // W/m^2
        kappaMethod     fluidThermo;
        value           $internalField;
    }
    pipeFullyDev
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 1000; // W/m^2
        kappaMethod     fluidThermo;
        value           $internalField;
    }
}


// ************************************************************************* //
