pipeSteadyFixdFlux_v2406/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.357472417251755);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.357472417251755);	    
    }

    outlet
    {
        type            zeroGradient;
    }

    pipeEntry
    {
        type            noSlip;
    }

    pipeFullyDev
    {
        type            noSlip;
    }
}

// ************************************************************************* //
