pipeSteadyFixdFlux_v2406/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.025;
length 20;
length1 40; 
vertices
(
    //block0 vertices
    (-0.25 0.25 0)		//0
    (-0.707106 0.707106 0)	//1
    (0.707106 0.707106 0)	//2
    (0.25 0.25 0)		//3
    (-0.25 0.25 $length)		//4
    (-0.707106 0.707106 $length)	//5
    (0.707106 0.707106 $length)	//6
    (0.25 0.25 $length)		//7

    //block1 new vertices
    (0.25 -0.25 0)		//8
    (0.707106 -0.707106 0)	//9
    (0.25 -0.25 $length)		//10
    (0.707106 -0.707106 $length)	//11

    //block3 new vertices
    (-0.25 -0.25 0)		//12
    (-0.707106 -0.707106 0)	//13
    (-0.25 -0.25 $length)		//14
    (-0.707106 -0.707106 $length)	//15
	
	//extension
    (-0.25 0.25 $length1)		//16
    (-0.707106 0.707106 $length1)	//17
    (0.707106 0.707106 $length1)	//18
    (0.25 0.25 $length1)		//19
    (0.25 -0.25 $length1)		//20
    (0.707106 -0.707106 $length1)	//21
    (-0.25 -0.25 $length1)		//22
    (-0.707106 -0.707106 $length1)	//23	
);

xcells 15;
ycells 35; //40;
zcells 40;

xcells1 15;
ycells1 15;
zcells1 40;

stretch 0.25;

blocks
(
    //block0
    hex (0 3 2 1 4 7 6 5) 	($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block1
    hex (3 8 9 2 7 10 11 6) 	($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block2
    hex (8 12 13 9 10 14 15 11) ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block3
    hex (12 0 1 13 14 4 5 15) 	($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block4
    hex (0 12 8 3 4 14 10 7) 	($xcells1 $ycells1 $zcells1) simpleGrading (1 1 1)
	
	//block5
    hex (4 7 6 5 16 19 18 17) 	($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block6
    hex (7 10 11 6 19 20 21 18) 	($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block7
    hex (10 14 15 11 20 22 23 21) ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block8
    hex (14 4 5 15 22 16 17 23) 	($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block9
    hex (4 14 10 7 16 22 20 19) 	($xcells1 $ycells1 $zcells1) simpleGrading (1 1 1)
);

edges
(
    //block0 arc
    arc 1 2  (0 1 0)
    arc 5 6  (0 1 $length)
    arc 17 18  (0 1 $length1)
    //block1 arc
    arc 2 9  (1 0 0)
    arc 6 11 (1 0 $length)
    arc 18 21 (1 0 $length1)
    //block2 arc
    arc 9 13  (0 -1 0)
    arc 11 15 (0 -1 $length)
    arc 21 23 (0 -1 $length1)
    //block3 arc
    arc 1 13  (-1 0 0)
    arc 5 15  (-1 0 $length)
    arc 17 23  (-1 0 $length1)
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (2 3 8 9)
            (8 9 13 12)
            (13 12 0 1)
            (0 3 8 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (16 17 18 19)
            (18 19 20 21)
            (23 21 20 22)
            (23 22 16 17)
            (16 19 20 22)
        );
    }

    pipeEntry
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (2 6 11 9)
            (9 11 15 13)
            (15 13 5 1)
        );
    }

    pipeFullyDev
    {
        type wall;
        faces
        (
            (5 17 18 6)
            (6 18 21 11)
            (11 21 23 15)
            (15 23 17 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
